Mota92i/FW_IPGN_v2_AAS/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t CDE_LUM_ZONE_3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 55)  */
    GPIO_PinInit(BOARD_INITPINS_CDE_LUM_ZONE_3_GPIO, BOARD_INITPINS_CDE_LUM_ZONE_3_PIN, &CDE_LUM_ZONE_3_config);

    gpio_pin_config_t CDE_LUM_ZONE_2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 56)  */
    GPIO_PinInit(BOARD_INITPINS_CDE_LUM_ZONE_2_GPIO, BOARD_INITPINS_CDE_LUM_ZONE_2_PIN, &CDE_LUM_ZONE_2_config);

    gpio_pin_config_t CDE_LUM_ZONE_1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB10 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_CDE_LUM_ZONE_1_GPIO, BOARD_INITPINS_CDE_LUM_ZONE_1_PIN, &CDE_LUM_ZONE_1_config);

    gpio_pin_config_t REG_LUM_GEN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB11 (pin 59)  */
    GPIO_PinInit(BOARD_INITPINS_REG_LUM_GEN_GPIO, BOARD_INITPINS_REG_LUM_GEN_PIN, &REG_LUM_GEN_config);

    gpio_pin_config_t RST_ETH_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB16 (pin 62)  */
    GPIO_PinInit(BOARD_INITPINS_RST_ETH_GPIO, BOARD_INITPINS_RST_ETH_PIN, &RST_ETH_config);

    gpio_pin_config_t VOLTMETRE_VOIE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB22 (pin 68)  */
    GPIO_PinInit(BOARD_INITPINS_VOLTMETRE_VOIE_GPIO, BOARD_INITPINS_VOLTMETRE_VOIE_PIN, &VOLTMETRE_VOIE_config);

    gpio_pin_config_t VOLTMETRE_READ_BASCULE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB23 (pin 69)  */
    GPIO_PinInit(BOARD_INITPINS_VOLTMETRE_READ_BASCULE_GPIO, BOARD_INITPINS_VOLTMETRE_READ_BASCULE_PIN, &VOLTMETRE_READ_BASCULE_config);

    gpio_pin_config_t MOTOR_YELLOW_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 70)  */
    GPIO_PinInit(BOARD_INITPINS_MOTOR_YELLOW_GPIO, BOARD_INITPINS_MOTOR_YELLOW_PIN, &MOTOR_YELLOW_config);

    gpio_pin_config_t MOTOR_RED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 71)  */
    GPIO_PinInit(BOARD_INITPINS_MOTOR_RED_GPIO, BOARD_INITPINS_MOTOR_RED_PIN, &MOTOR_RED_config);

    gpio_pin_config_t MOTOR_BLUE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 72)  */
    GPIO_PinInit(BOARD_INITPINS_MOTOR_BLUE_GPIO, BOARD_INITPINS_MOTOR_BLUE_PIN, &MOTOR_BLUE_config);

    gpio_pin_config_t MOTOR_ORANGE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 73)  */
    GPIO_PinInit(BOARD_INITPINS_MOTOR_ORANGE_GPIO, BOARD_INITPINS_MOTOR_ORANGE_PIN, &MOTOR_ORANGE_config);

    gpio_pin_config_t LUM_GEN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC14 (pin 86)  */
    GPIO_PinInit(BOARD_INITPINS_LUM_GEN_GPIO, BOARD_INITPINS_LUM_GEN_PIN, &LUM_GEN_config);

    gpio_pin_config_t LUM_ZONE_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC15 (pin 87)  */
    GPIO_PinInit(BOARD_INITPINS_LUM_ZONE_1_GPIO, BOARD_INITPINS_LUM_ZONE_1_PIN, &LUM_ZONE_1_config);

    gpio_pin_config_t LUM_ZONE_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC16 (pin 90)  */
    GPIO_PinInit(BOARD_INITPINS_LUM_ZONE_2_GPIO, BOARD_INITPINS_LUM_ZONE_2_PIN, &LUM_ZONE_2_config);

    gpio_pin_config_t LUM_ZONE_3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC17 (pin 91)  */
    GPIO_PinInit(BOARD_INITPINS_LUM_ZONE_3_GPIO, BOARD_INITPINS_LUM_ZONE_3_PIN, &LUM_ZONE_3_config);

    gpio_pin_config_t UART0_BREAK_DETECT_IN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC18 (pin 92)  */
    GPIO_PinInit(BOARD_INITPINS_UART0_BREAK_DETECT_IN_GPIO, BOARD_INITPINS_UART0_BREAK_DETECT_IN_PIN, &UART0_BREAK_DETECT_IN_config);

    gpio_pin_config_t DEBUG_PORT_E0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE0 (pin 1)  */
    GPIO_PinInit(BOARD_INITPINS_DEBUG_PORT_E0_GPIO, BOARD_INITPINS_DEBUG_PORT_E0_PIN, &DEBUG_PORT_E0_config);

    /* PORTA12 (pin 42) is configured as RMII0_RXD1 */
    PORT_SetPinMux(PORTA, 12U, kPORT_MuxAlt4);

    /* PORTA13 (pin 43) is configured as RMII0_RXD0 */
    PORT_SetPinMux(PORTA, 13U, kPORT_MuxAlt4);

    /* PORTA14 (pin 44) is configured as RMII0_CRS_DV */
    PORT_SetPinMux(PORTA, 14U, kPORT_MuxAlt4);

    /* PORTA15 (pin 45) is configured as RMII0_TXEN */
    PORT_SetPinMux(PORTA, 15U, kPORT_MuxAlt4);

    /* PORTA16 (pin 46) is configured as RMII0_TXD0 */
    PORT_SetPinMux(PORTA, 16U, kPORT_MuxAlt4);

